import './Main.css';
import {NavLink} from "react-router-dom";
import Shabrat from "./photos/shabrat.png";
import Shevchenko from "./photos/shevhcneko.png";
import NavBar from "../NavBar/NavBar";

function Main() {

    return (
        <div>
            <NavBar/>

            <div className={"main-main-cont"}>

                <div className={"main-title"}>
                    Ласкаво просимо до Grammarzone!
                </div>
                <div className={"main-text-gray"}>
                    <h3 className={"main-text"}>
                        Ми з радістю представляємо вам наш веб-додаток, розроблений як кваліфікаційний проект двох
                        студентів. Нашою метою було створити зручний та ефективний інструмент, який може
                        слугувати надійним помічником у вивченні англійської мови.
                        <br/>
                        У сучасному світі володіння англійською мовою має велике значення. Воно відчиняє двері до нових
                        можливостей, полегшує комунікацію та допомагає подолати виклики як у особистому, так і у
                        професійному житті. Ми розуміємо важливість розвитку мовних навичок і прагнемо надати
                        користувачам легкий та ефективний шлях до покращення.
                        <br/>
                        Grammarzone пропонує широкий спектр ресурсів та вправ, створених з фокусом на основних аспектах
                        граматики англійської мови. Тут ви знайдете навчальні матеріали, що підтримують ваш шлях
                        навчання, а також тести, що закріплюють ваші знання та відстежують ваш прогрес. Ми сподіваємося,
                        що Grammarzone стане вашим надійним партнером у вивченні англійської мови.
                        Незалежно від того, чи ви студент, викладач чи просто ентузіаст англійської мови, наш додаток
                        надасть вам цінні інструменти для успішної освіти. Ласкаво просимо до Grammarzone, вашого нового
                        помічника у володінні англійською мовою!
                    </h3>
                </div>
                <div className={"main-text-blue"}>
                    <h3 className={"main-text"}>
                        Щоб почати, виберіть тип тесту: Переклад, Читання, Письмо. Потім виберіть рівень мови та тест,
                        який ви хочете здати. Щоб отримати доступ до навчальних матеріалів, перейдіть на вкладку
                        "Матеріали". Зареєструйтеся та увійдіть, щоб відстежувати ваш прогрес.
                    </h3>
                </div>
                <div className={"main-text-gray"}>
                    <h3 className={"main-text"}>
                        Розробники
                    </h3>
                </div>
                <div className={"main-text-blue-photo"}>
                    <img className={"main-text-blue-img"} src={Shabrat}/>
                    <h3 className={"main-text"}>
                        Алексій Шабрат
                        <br/>
                        Група КН 19-1
                        <br/>
                        Дніпровського Технологічного Университету "ШАГ"
                    </h3>
                </div>
                <div className={"main-text-gray-photo"}>
                    <img className={"main-text-gray-img"} src={Shevchenko}/>
                    <h3 className={"main-text"}>
                        Нікіта Шевченко
                        <br/>
                        Група КН 19-1
                        <br/>
                        Дніпровського Технологічного Университету "ШАГ"
                    </h3>
                </div>
            </div>
        </div>
    );
}

export default Main;